# <font color='blue'>Data Science Academy - Big Data Real-Time Analytics com Python e Spark</font>

# <font color='blue'>Capítulo 2</font>

# Estruturas de Dados em Pandas



pandas.Series()          - 1 Dimensão  - 1D

pandas.DataFrame()  - 2 Dimensões - 2D

pandas.Panel()           - 3 Dimensões - 3D

numpy.ndarray()     - x Dimensões

# DataFrames

In [1]:
import pandas as pd
import numpy as np

In [2]:
stock = {'AMZN': pd.Series([346.15,0.59,459,0.52,589.8,158.88],
                           index = ['Closing price','EPS','Shares Outstanding(M)', 
                                  'Beta', 'P/E','Market Cap(B)']),
         'GOOG': pd.Series([1133.43,36.05,335.83,0.87,31.44,380.64],
                            index = ['Closing price','EPS','Shares Outstanding(M)',
                                  'Beta','P/E','Market Cap(B)']),
         'FB': pd.Series([61.48,0.59,2450,104.93,150.92],
                            index = ['Closing price','EPS','Shares Outstanding(M)',
                                  'P/E', 'Market Cap(B)']),
         'YHOO': pd.Series([34.90,1.27,1010,27.48,0.66,35.36],
                            index=['Closing price','EPS','Shares Outstanding(M)',
                                  'P/E','Beta', 'Market Cap(B)']),
         'TWTR':pd.Series([65.25,-0.3,555.2,36.23],
                            index=['Closing price','EPS','Shares Outstanding(M)',
                                  'Market Cap(B)']),
         'AAPL':pd.Series([501.53,40.32,892.45,12.44,447.59,0.84],
                            index=['Closing price','EPS','Shares Outstanding(M)','P/E',
                                  'Market Cap(B)','Beta'])}

In [3]:
type(stock)

dict

In [4]:
stock_df = pd.DataFrame(stock)

In [5]:
stock_df

                         AAPL    AMZN       FB     GOOG    TWTR     YHOO
Beta                     0.84    0.52      NaN     0.87     NaN     0.66
Closing price          501.53  346.15    61.48  1133.43   65.25    34.90
EPS                     40.32    0.59     0.59    36.05   -0.30     1.27
Market Cap(B)          447.59  158.88   150.92   380.64   36.23    35.36
P/E                     12.44  589.80   104.93    31.44     NaN    27.48
Shares Outstanding(M)  892.45  459.00  2450.00   335.83  555.20  1010.00

In [6]:
stock_df = pd.DataFrame(stock, 
                        index = ['Closing price',
                                 'EPS', 
                                 'Shares Outstanding(M)',
                                 'P/E', 
                                 'Market Cap(B)',
                                 'Beta'])

In [7]:
stock_df

                         AAPL    AMZN       FB     GOOG    TWTR     YHOO
Closing price          501.53  346.15    61.48  1133.43   65.25    34.90
EPS                     40.32    0.59     0.59    36.05   -0.30     1.27
Shares Outstanding(M)  892.45  459.00  2450.00   335.83  555.20  1010.00
P/E                     12.44  589.80   104.93    31.44     NaN    27.48
Market Cap(B)          447.59  158.88   150.92   380.64   36.23    35.36
Beta                     0.84    0.52      NaN     0.87     NaN     0.66

In [8]:
stock_df = pd.DataFrame(stock,
                        index = ['Closing price',
                                 'EPS',
                                 'Shares Outstanding(M)',
                                 'P/E', 
                                 'Market Cap(B)',
                                 'Beta'],
                        columns = ['FB','TWTR','SCNW'])

In [9]:
stock_df

                            FB    TWTR SCNW
Closing price            61.48   65.25  NaN
EPS                       0.59   -0.30  NaN
Shares Outstanding(M)  2450.00  555.20  NaN
P/E                     104.93     NaN  NaN
Market Cap(B)           150.92   36.23  NaN
Beta                       NaN     NaN  NaN

In [10]:
stock_df.index

Index(['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Market Cap(B)',
       'Beta'],
      dtype='object')

In [11]:
stock_df.columns

Index(['FB', 'TWTR', 'SCNW'], dtype='object')

## Operações com DataFrames

In [12]:
Quadro_Medalhas_Rio_2016 = {
    'USA' : {'Ouro':46, 'Prata':37, 'Bronze':38},
    'China':{'Ouro':26, 'Prata':18, 'Bronze':26},
    'Britain':{'Ouro':27, 'Prata':23, 'Bronze':17},
    'Russe':{'Ouro':19, 'Prata':18, 'Bronze':19},
    'Germany':{'Ouro':17, 'Prata':10, 'Bronze':15}}

In [13]:
Rio_2016 = pd.DataFrame.from_dict(Quadro_Medalhas_Rio_2016)

In [14]:
Rio_2016

        Britain  China  Germany  Russe  USA
Bronze       17     26       15     19   38
Ouro         27     26       17     19   46
Prata        23     18       10     18   37

In [15]:
type(Rio_2016)

pandas.core.frame.DataFrame

In [16]:
Medalhas_China = Rio_2016['China']

In [17]:
Medalhas_China

Bronze    26
Ouro      26
Prata     18
Name: China, dtype: int64

In [18]:
Rio_2016['China']

Bronze    26
Ouro      26
Prata     18
Name: China, dtype: int64

In [19]:
Rio_2016.Russe

Bronze    19
Ouro      19
Prata     18
Name: Russe, dtype: int64

In [20]:
Rio_2016[['Russe','Germany']]

        Russe  Germany
Bronze     19       15
Ouro       19       17
Prata      18       10

In [21]:
Rio_2016.get('Germany')

Bronze    15
Ouro      17
Prata     10
Name: Germany, dtype: int64

In [22]:
Rio_2016

        Britain  China  Germany  Russe  USA
Bronze       17     26       15     19   38
Ouro         27     26       17     19   46
Prata        23     18       10     18   37

In [23]:
Rio_2016[[1]]

        China
Bronze     26
Ouro       26
Prata      18

## Slicing

In [24]:
Rio_2016[:2]

        Britain  China  Germany  Russe  USA
Bronze       17     26       15     19   38
Ouro         27     26       17     19   46

In [25]:
Rio_2016[2:]

       Britain  China  Germany  Russe  USA
Prata       23     18       10     18   37

In [26]:
Rio_2016[::2]

        Britain  China  Germany  Russe  USA
Bronze       17     26       15     19   38
Prata        23     18       10     18   37

In [27]:
Rio_2016[::-1]

        Britain  China  Germany  Russe  USA
Prata        23     18       10     18   37
Ouro         27     26       17     19   46
Bronze       17     26       15     19   38

In [28]:
Rio_2016

        Britain  China  Germany  Russe  USA
Bronze       17     26       15     19   38
Ouro         27     26       17     19   46
Prata        23     18       10     18   37

## Slicing por indexação

In [29]:
Rio_2016.loc['Ouro']

Britain    27
China      26
Germany    17
Russe      19
USA        46
Name: Ouro, dtype: int64

In [30]:
Rio_2016.loc[:,'USA']

Bronze    38
Ouro      46
Prata     37
Name: USA, dtype: int64

In [31]:
Rio_2016.loc['Prata','China']

18

In [32]:
Rio_2016.loc['Prata']['China']

18

In [33]:
Rio_2016.loc['Prata']

Britain    23
China      18
Germany    10
Russe      18
USA        37
Name: Prata, dtype: int64

In [34]:
Rio_2016.loc['Ouro'] > 20

Britain     True
China       True
Germany    False
Russe      False
USA         True
Name: Ouro, dtype: bool

In [35]:
Rio_2016.loc[:,Rio_2016.loc['Ouro'] > 20]

        Britain  China  USA
Bronze       17     26   38
Ouro         27     26   46
Prata        23     18   37

In [36]:
Rio_2016.loc['Prata'] > 20

Britain     True
China      False
Germany    False
Russe      False
USA         True
Name: Prata, dtype: bool

In [37]:
Rio_2016.iloc[:2]

        Britain  China  Germany  Russe  USA
Bronze       17     26       15     19   38
Ouro         27     26       17     19   46

In [38]:
Rio_2016.iloc[2,0:2]

Britain    23
China      18
Name: Prata, dtype: int64

In [39]:
Rio_2016.iloc[2:3, :]

       Britain  China  Germany  Russe  USA
Prata       23     18       10     18   37

In [40]:
Rio_2016.iloc[1,:]

Britain    27
China      26
Germany    17
Russe      19
USA        46
Name: Ouro, dtype: int64

In [41]:
Rio_2016.iloc[2, 0]

23

## Removendo um membro do dataframe

In [42]:
del Rio_2016['USA']

In [43]:
Rio_2016

        Britain  China  Germany  Russe
Bronze       17     26       15     19
Ouro         27     26       17     19
Prata        23     18       10     18

## Inserindo um membro no dataframe

In [44]:
Rio_2016.insert(0, 'Brasil', (7, 6, 6))

In [45]:
Rio_2016

        Brasil  Britain  China  Germany  Russe
Bronze       7       17     26       15     19
Ouro         6       27     26       17     19
Prata        6       23     18       10     18

## Outras operações matemáticas

In [46]:
Rio_2016.describe()

         Brasil    Britain      China    Germany      Russe
count  3.000000   3.000000   3.000000   3.000000   3.000000
mean   6.333333  22.333333  23.333333  14.000000  18.666667
std    0.577350   5.033223   4.618802   3.605551   0.577350
min    6.000000  17.000000  18.000000  10.000000  18.000000
25%    6.000000  20.000000  22.000000  12.500000  18.500000
50%    6.000000  23.000000  26.000000  15.000000  19.000000
75%    6.500000  25.000000  26.000000  16.000000  19.000000
max    7.000000  27.000000  26.000000  17.000000  19.000000

# Fim

### Obrigado - Data Science Academy - <a href=http://facebook.com/dsacademy>facebook.com/dsacademybr</a>